---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.IsValid
source: html/6bf584e2-0e6c-418a-e1e4-8d1ea21554a8.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.IsValid Method

Checks if this object is a valid alignment station label.

## Syntax (C#)
```csharp
public bool IsValid()
```